<!-- attach-outputs:plan-nodes-prod.txt -->
  <!-- Output: plan-nodes-prod.txt -->
  #### plan-nodes-prod.txt 📖: `test: success, prod: success`

  **Last updated:** Mar 19, 2026, 12:28 PM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.module.talos-vm["tiles-cp-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7211"
      ~ ipv4_addresses                       = [
            # (6 unchanged elements hidden)
            [],
          ~ [
                "10.0.128.11",
              - "10.0.128.10",
            ],
            [],
            # (9 unchanged elements hidden)
        ]
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7211",
            ],
          ~ [
              ~ "fe80::60aa:83ff:feab:f1b7" -> "fe80::d449:71ff:fe1a:4116",
            ],
          ~ [
              ~ "fe80::784e:c2ff:fe31:d344" -> "fe80::78b5:6eff:fe83:bafe",
            ],
            [
                "fe80::200:ff:fe00:0",
            ],
            # (7 unchanged elements hidden)
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "46:76:FD:B6:5D:05" -> "CE:B3:27:BA:42:90",
          ~ "5E:5F:3E:68:5C:83" -> "BA:7E:75:BD:92:18",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:72:11",
          ~ "62:AA:83:AB:F1:B7" -> "D6:49:71:1A:41:16",
          ~ "7A:4E:C2:31:D3:44" -> "7A:B5:6E:83:BA:FE",
            "00:00:00:00:00:00",
            # (7 unchanged elements hidden)
        ]
        name                                 = "tiles-cp-1"
      ~ network_interface_names              = [
            # (10 unchanged elements hidden)
            "lxc_health",
          ~ "lxcbdccbf1a8c64" -> "lxcd586d5601f51",
          ~ "lxc95bf0a1f6279" -> "lxc9aa0084a321e",
          ~ "lxc17856e17ced2" -> "lxce219c5cada5a",
          ~ "lxc2b7995166afd" -> "lxcbad1b856ce4a",
          ~ "lxc4e8928bd490a" -> "lxc1742d9b401d3",
          ~ "lxc743ae28a3460" -> "lxca45dfe7e7190",
          ~ "lxcab7c1dfaaa0e" -> "lxc1ab084660fc7",
        ]
        tags                                 = []
        # (31 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7212"
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7212",
            ],
          ~ [
              ~ "fe80::dca2:82ff:fe3d:c51f" -> "fe80::78d9:c7ff:fe0c:79c6",
            ],
          ~ [
              ~ "fe80::a88f:58ff:fe81:e71b" -> "fe80::d025:82ff:fe69:b1f",
            ],
            [
                "fe80::200:ff:fe00:0",
            ],
            # (2 unchanged elements hidden)
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "1E:63:0F:09:4E:48" -> "8E:84:30:EF:A6:27",
          ~ "EA:95:79:51:64:B0" -> "42:BC:A9:BF:A6:CD",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:72:12",
          ~ "DE:A2:82:3D:C5:1F" -> "7A:D9:C7:0C:79:C6",
          ~ "AA:8F:58:81:E7:1B" -> "D2:25:82:69:0B:1F",
            "00:00:00:00:00:00",
            # (2 unchanged elements hidden)
        ]
        name                                 = "tiles-cp-2"
      ~ network_interface_names              = [
            # (9 unchanged elements hidden)
            "cilium_host",
          ~ "lxc_health" -> "lxc26ffe9f9084a",
          ~ "lxcf40f99ee0baf" -> "lxc92119a3b63c3",
          ~ "lxcaa0b674641bd" -> "lxc_health",
        ]
        tags                                 = []
        # (32 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7213"
      ~ ipv4_addresses                       = [
            # (6 unchanged elements hidden)
            [],
          ~ [
                "10.0.128.13",
              + "10.0.128.10",
            ],
            [],
            # (5 unchanged elements hidden)
        ]
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7213",
            ],
          ~ [
              ~ "fe80::9cf3:7dff:fe51:9aee" -> "fe80::fc4c:4dff:feac:aa7f",
            ],
          ~ [
              ~ "fe80::47:9dff:fee7:4b1a" -> "fe80::8087:eff:fe2e:2629",
            ],
            [
                "fe80::200:ff:fe00:0",
            ],
            # (3 unchanged elements hidden)
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "B6:EA:67:4F:3E:AF" -> "1E:51:DF:F9:F6:FC",
          ~ "2E:F9:94:CD:DC:77" -> "B6:56:7F:12:21:15",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:72:13",
          ~ "9E:F3:7D:51:9A:EE" -> "FE:4C:4D:AC:AA:7F",
          ~ "02:47:9D:E7:4B:1A" -> "82:87:0E:2E:26:29",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
        ]
        name                                 = "tiles-cp-3"
      ~ network_interface_names              = [
            # (10 unchanged elements hidden)
            "lxc_health",
          ~ "lxcfd4fe22217b1" -> "lxc6bb14820ae48",
          ~ "lxc2111bbe63fc7" -> "lxc94ce7cf20ce4",
          ~ "lxc07a3ad9ab239" -> "lxc3f41fe8aa6a2",
        ]
        tags                                 = []
        # (31 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7221"
      ~ ipv4_addresses                       = [
            # (22 unchanged elements hidden)
            [],
          + [],
        ]
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7221",
            ],
          - [
              - "fe80::d4d8:96ff:fec8:1de9",
            ],
          - [
              - "fe80::5c55:39ff:feb5:8748",
            ],
          + [
              + "fe80::88ca:fdff:fe21:e57c",
            ],
          + [
              + "fe80::f0bf:acff:fe1b:e77",
            ],
            [
                "fe80::200:ff:fe00:0",
            ],
            # (11 unchanged elements hidden)
            [
                "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          - "9A:B1:00:38:64:75",
          - "0A:0A:EF:A2:12:6C",
          + "AA:E2:5E:2E:5E:B3",
          + "92:AC:82:F1:93:25",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:72:21",
          - "D6:D8:96:C8:1D:E9",
          - "5E:55:39:B5:87:48",
          + "8A:CA:FD:21:E5:7C",
          + "F2:BF:AC:1B:0E:77",
            "00:00:00:00:00:00",
            # (11 unchanged elements hidden)
            "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
        ]
        name                                 = "tiles-wk-1"
      ~ network_interface_names              = [
            # (10 unchanged elements hidden)
            "lxc_health",
          - "lxc6e17892e4427",
          - "lxc3a11ef7ef0c3",
          - "lxc753c6215e237",
          - "lxc81b8256c4a9d",
          - "lxc92e12c4dbb6b",
          - "lxcd5d4e29db3d7",
          - "lxcf2d883a121a8",
          - "lxc561c555ae94e",
          - "lxc79a942d9a35d",
          - "lxcbf1f5844dfe0",
          - "lxc9564ed83f390",
          - "lxc5db857f9cecb",
          + "lxc3f7da327ff35",
          + "lxc15c47e5f3d0e",
          + "lxcca996e05e458",
          + "lxcfd16370817c3",
          + "lxc545dff9632f9",
          + "lxc1b2b20be617e",
          + "lxce2193a745716",
          + "lxc0d5497a82cc1",
          + "lxc77b0b5d0f901",
          + "lxc07d680ac1b32",
          + "lxc6a3e17a45079",
          + "lxc81095f3676e3",
          + "lxc5a3bc1a41827",
        ]
        tags                                 = []
        # (31 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7222"
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7222",
            ],
          ~ [
              ~ "fe80::901e:2aff:feba:6062" -> "fe80::94ce:70ff:fe73:15e8",
            ],
          ~ [
              ~ "fe80::499:77ff:fef7:325a" -> "fe80::e430:3cff:fe23:5fb2",
            ],
            [
                "fe80::200:ff:fe00:0",
            ],
            # (16 unchanged elements hidden)
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "3E:97:9C:B1:1A:B7" -> "D6:3C:21:1F:5C:0C",
          ~ "86:D6:C2:9F:E7:35" -> "4E:1C:18:3B:F8:9B",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:72:22",
          ~ "92:1E:2A:BA:60:62" -> "96:CE:70:73:15:E8",
          ~ "06:99:77:F7:32:5A" -> "E6:30:3C:23:5F:B2",
            "00:00:00:00:00:00",
            # (16 unchanged elements hidden)
        ]
        name                                 = "tiles-wk-2"
      ~ network_interface_names              = [
            # (10 unchanged elements hidden)
            "lxc_health",
          ~ "lxcca350859a089" -> "lxc648ba0d18425",
          ~ "lxcad73c0c4ab8a" -> "lxc4268a160179e",
          ~ "lxc5383603bc14b" -> "lxce9183b51eb19",
          ~ "lxc1cdb782120c1" -> "lxc255cec02b4ab",
          ~ "lxc99046fb42aac" -> "lxc8e24c971ab16",
          ~ "lxc8f70b20c0345" -> "lxcdc0d42d3ef57",
          ~ "lxc6d1fecc981a8" -> "lxce0292b9562da",
          ~ "lxc74809df968d1" -> "lxc56e50bfee432",
          ~ "lxc60923817361e" -> "lxcc49329c0c4bf",
          ~ "lxc9dfe1e9042b7" -> "lxcd8aef87dfe3e",
          ~ "lxc01ab16aef078" -> "lxc898502bef889",
          ~ "lxc8384a75c9bec" -> "lxcb6cd983c6ce9",
          ~ "lxc1f6636e72a43" -> "lxc81f9f904d761",
          ~ "lxc9c28df0ad587" -> "lxc00de0315538b",
          ~ "lxccb3e211a75a3" -> "lxc570079ddcb77",
          ~ "lxc916364b1e0b1" -> "lxc43d2be0427df",
        ]
        tags                                 = []
        # (32 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7223"
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7223",
            ],
          ~ [
              ~ "fe80::d053:91ff:feab:eb07" -> "fe80::f82c:9dff:feb6:b5bc",
            ],
          ~ [
              ~ "fe80::60:3ff:fe53:3750" -> "fe80::c4db:94ff:fe91:d518",
            ],
            [
                "fe80::200:ff:fe00:0",
            ],
            # (15 unchanged elements hidden)
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "FE:9C:C9:79:1F:3F" -> "42:82:90:5F:D8:00",
          ~ "6A:BC:5E:02:66:08" -> "CA:74:6C:57:9B:70",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:72:23",
          ~ "D2:53:91:AB:EB:07" -> "FA:2C:9D:B6:B5:BC",
          ~ "02:60:03:53:37:50" -> "C6:DB:94:91:D5:18",
            "00:00:00:00:00:00",
            # (15 unchanged elements hidden)
        ]
        name                                 = "tiles-wk-3"
      ~ network_interface_names              = [
            # (10 unchanged elements hidden)
            "lxc_health",
          ~ "lxc727c72ed2601" -> "lxc9c87d31fe10a",
          ~ "lxc1f6fbdf01f3b" -> "lxc9b3629ca36c1",
          ~ "lxcd029dc5073ca" -> "lxc34a4b763503c",
          ~ "lxccf4627058d5f" -> "lxcc7a71f75c30c",
          ~ "lxcc79e3cb73ae8" -> "lxc86b80877af5f",
          ~ "lxccbda33ddae68" -> "lxcd2e571cea06d",
          ~ "lxc0d67e2bdeeaa" -> "lxc3b654531712d",
          ~ "lxc104e6b70a1ff" -> "lxca80aed1e102f",
          ~ "lxc7da3018528b1" -> "lxcd0a81a1f4a5c",
          ~ "lxc3e93c243dca7" -> "lxcbb10ba9d8dde",
          ~ "lxc43db962d0314" -> "lxcfff4aaf39652",
          ~ "lxc6eb6c8d84cf6" -> "lxca9f3fb0ebd51",
          ~ "lxc359487504d57" -> "lxc29cce7c58d10",
          ~ "lxc2db77cd87392" -> "lxcc17a4a85b648",
          ~ "lxc69b0c0c9bbd5" -> "lxcb5a9daa2cdcb",
        ]
        tags                                 = []
        # (32 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_virtual_environment_container.alloy["nuc-g2p-1"] will be created
  + resource "proxmox_virtual_environment_container" "alloy" {
      + description    = <<-EOT
            Alloy monitoring container for nuc-g2p-1 - collects host metrics and logs via node_exporter (hwmon sensors) and system logs
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "nuc-g2p-1"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "alloy",
          + "monitoring",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = false
      + vm_id          = 200

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 4
        }

      + initialization {
          + hostname = "alloy-nuc-g2p-1"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + mount_point {
          + acl               = false
          + backup            = false
          + path              = "/host"
          + path_in_datastore = (known after apply)
          + quota             = false
          + read_only         = true
          + replicate         = true
          + shared            = false
          + volume            = "/"
        }

      + network_interface {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "net0"
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + template_file_id = (known after apply)
          + type             = "ubuntu"
        }
    }

  # proxmox_virtual_environment_container.alloy["nuc-g2p-2"] will be created
  + resource "proxmox_virtual_environment_container" "alloy" {
      + description    = <<-EOT
            Alloy monitoring container for nuc-g2p-2 - collects host metrics and logs via node_exporter (hwmon sensors) and system logs
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "nuc-g2p-2"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "alloy",
          + "monitoring",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = false
      + vm_id          = 200

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 4
        }

      + initialization {
          + hostname = "alloy-nuc-g2p-2"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + mount_point {
          + acl               = false
          + backup            = false
          + path              = "/host"
          + path_in_datastore = (known after apply)
          + quota             = false
          + read_only         = true
          + replicate         = true
          + shared            = false
          + volume            = "/"
        }

      + network_interface {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "net0"
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + template_file_id = (known after apply)
          + type             = "ubuntu"
        }
    }

  # proxmox_virtual_environment_container.alloy["nuc-g3p-1"] will be created
  + resource "proxmox_virtual_environment_container" "alloy" {
      + description    = <<-EOT
            Alloy monitoring container for nuc-g3p-1 - collects host metrics and logs via node_exporter (hwmon sensors) and system logs
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "nuc-g3p-1"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "alloy",
          + "monitoring",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = false
      + vm_id          = 200

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 4
        }

      + initialization {
          + hostname = "alloy-nuc-g3p-1"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + mount_point {
          + acl               = false
          + backup            = false
          + path              = "/host"
          + path_in_datastore = (known after apply)
          + quota             = false
          + read_only         = true
          + replicate         = true
          + shared            = false
          + volume            = "/"
        }

      + network_interface {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "net0"
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + template_file_id = (known after apply)
          + type             = "ubuntu"
        }
    }

  # proxmox_virtual_environment_container.alloy["nuc-g3p-2"] will be created
  + resource "proxmox_virtual_environment_container" "alloy" {
      + description    = <<-EOT
            Alloy monitoring container for nuc-g3p-2 - collects host metrics and logs via node_exporter (hwmon sensors) and system logs
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "nuc-g3p-2"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "alloy",
          + "monitoring",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = false
      + vm_id          = 200

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 4
        }

      + initialization {
          + hostname = "alloy-nuc-g3p-2"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + mount_point {
          + acl               = false
          + backup            = false
          + path              = "/host"
          + path_in_datastore = (known after apply)
          + quota             = false
          + read_only         = true
          + replicate         = true
          + shared            = false
          + volume            = "/"
        }

      + network_interface {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "net0"
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + template_file_id = (known after apply)
          + type             = "ubuntu"
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g2p-1"] will be created
  + resource "proxmox_virtual_environment_file" "alloy_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "nuc-g2p-1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
                // Node exporter for host system metrics
                // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
                  procfs_path = "/host/proc"
                  sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g2p-1"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g2p-1",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g2p-1",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g2p-1",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g2p-1",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          + file_name = "alloy-proxmox-nuc-g2p-1.alloy"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g2p-2"] will be created
  + resource "proxmox_virtual_environment_file" "alloy_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "nuc-g2p-2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
                // Node exporter for host system metrics
                // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
                  procfs_path = "/host/proc"
                  sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g2p-2"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g2p-2",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g2p-2",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g2p-2",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g2p-2",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          + file_name = "alloy-proxmox-nuc-g2p-2.alloy"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g3p-1"] will be created
  + resource "proxmox_virtual_environment_file" "alloy_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "nuc-g3p-1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
                // Node exporter for host system metrics
                // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
                  procfs_path = "/host/proc"
                  sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g3p-1"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g3p-1",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g3p-1",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g3p-1",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g3p-1",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          + file_name = "alloy-proxmox-nuc-g3p-1.alloy"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g3p-2"] will be created
  + resource "proxmox_virtual_environment_file" "alloy_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "nuc-g3p-2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
                // Node exporter for host system metrics
                // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
                  procfs_path = "/host/proc"
                  sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g3p-2"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g3p-2",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g3p-2",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g3p-2",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g3p-2",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          + file_name = "alloy-proxmox-nuc-g3p-2.alloy"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_oci_image.alloy["nuc-g2p-1"] will be created
  + resource "proxmox_virtual_environment_oci_image" "alloy" {
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g2p-1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + reference           = "docker.io/grafana/alloy:latest"
      + size                = (known after apply)
      + upload_timeout      = 600
    }

  # proxmox_virtual_environment_oci_image.alloy["nuc-g2p-2"] will be created
  + resource "proxmox_virtual_environment_oci_image" "alloy" {
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g2p-2"
      + overwrite           = true
      + overwrite_unmanaged = false
      + reference           = "docker.io/grafana/alloy:latest"
      + size                = (known after apply)
      + upload_timeout      = 600
    }

  # proxmox_virtual_environment_oci_image.alloy["nuc-g3p-1"] will be created
  + resource "proxmox_virtual_environment_oci_image" "alloy" {
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g3p-1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + reference           = "docker.io/grafana/alloy:latest"
      + size                = (known after apply)
      + upload_timeout      = 600
    }

  # proxmox_virtual_environment_oci_image.alloy["nuc-g3p-2"] will be created
  + resource "proxmox_virtual_environment_oci_image" "alloy" {
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g3p-2"
      + overwrite           = true
      + overwrite_unmanaged = false
      + reference           = "docker.io/grafana/alloy:latest"
      + size                = (known after apply)
      + upload_timeout      = 600
    }

Plan: 12 to add, 0 to change, 0 to destroy.

  ```

  </details>
  
  